Public Member Functions | Protected Member Functions | List of all members
ACAPI::MEP::DuctBranchPreferenceTable::Modifier Class Reference
MEP Element Manager
Modifier of the DuctBranchPreferenceTable. More...
#include <MEPDuctBranchPreferenceTable.hpp>
 Inheritance diagram for ACAPI::MEP::DuctBranchPreferenceTable::Modifier:
 Public Member Functions
void  | SetName (const GS::UniString &tableName)
Sets the name of the table.
Result< uint32_t >  | AddNewRow (const Key &key)
Inserts a new row into the table.
Result< void >  | DeleteRow (uint32_t index)
Deletes a row from the table.
Result< void >  | DeleteRowByKey (const Key &key)
Deletes a row from the table.
Result< void >  | SetMainAxisDiameter (uint32_t index, double diameter)
Sets the main axis diameter value of a table's row.
Result< void >  | SetMainAxisDiameterByKey (const Key &key, double diameter)
Sets the main axis diameter value of a table's row.
Result< void >  | SetBranchAxisDiameter (uint32_t index, double diameter)
Sets the branch axis diameter value of a table's row.
Result< void >  | SetBranchAxisDiameterByKey (const Key &key, double diameter)
Sets the branch axis diameter value of a table's row.
Result< void >  | SetLength (uint32_t index, double length)
Sets the length value of a table's row.
Result< void >  | SetLengthByKey (const Key &key, double length)
Sets the diameter value of a table's row.
Result< void >  | SetBranchOffset (uint32_t index, double branchOffset)
Sets the branch offset value of a table's row.
Result< void >  | SetBranchOffsetByKey (const Key &key, double branchOffset)
Sets the branch offset value of a table's row.
Result< void >  | SetConnectionLength (uint32_t index, double connectionLength)
Sets the connection length value of a table's row.
Result< void >  | SetConnectionLengthByKey (const Key &key, double connectionLength)
Sets the connection length value of a table's row.
Result< void >  | SetDescription (uint32_t index, const GS::UniString &description)
Sets the description of a table's row.
Result< void >  | SetDescriptionByKey (const Key &key, const GS::UniString &description)
Sets the description of a table's row.
 Protected Member Functions
Modifier (DuctBranchPreferenceTable &parent)
Constructs a Modifier with the given DuctBranchPreferenceTable.
Detailed Description
Modifier of the DuctBranchPreferenceTable.
Constructor & Destructor Documentation
◆ Modifier()
 ACAPI::MEP::DuctBranchPreferenceTable::Modifier::Modifier  |  ( |  DuctBranchPreferenceTable & |  parent | )
protected
Constructs a Modifier with the given DuctBranchPreferenceTable.
Parameters
parent | The given DuctBranchPreferenceTable.
Member Function Documentation
◆ AddNewRow()
 Result< uint32_t > ACAPI::MEP::DuctBranchPreferenceTable::Modifier::AddNewRow  |  ( |  const Key & |  key | )
Inserts a new row into the table.
Parameters
key | The key that uniquely identifies a row in the DuctBranchPreferenceTable.
Returns
Returns error if a row with he same referenceIds and branch axis angle is already present in the table or if the branch axis referenceId is larger than the main axis referenceId, otherwise the index of the new row.
◆ DeleteRow()
 Result< void > ACAPI::MEP::DuctBranchPreferenceTable::Modifier::DeleteRow  |  ( |  uint32_t |  index | )
Deletes a row from the table.
Parameters
index | The index of the row. Index starts from 0.
Returns
Returns error if the index is out of range, otherwise nothing.
◆ DeleteRowByKey()
 Result< void > ACAPI::MEP::DuctBranchPreferenceTable::Modifier::DeleteRowByKey  |  ( |  const Key & |  key | )
Deletes a row from the table.
Parameters
key | The key that uniquely identifies a row in the DuctBranchPreferenceTable.
Returns
Returns error if a row for a given key does not occur in the table, otherwise nothing.
◆ SetBranchAxisDiameter()
 Result< void > ACAPI::MEP::DuctBranchPreferenceTable::Modifier::SetBranchAxisDiameter  |  ( |  uint32_t |  index,
|  double |  diameter )
Sets the branch axis diameter value of a table's row.
Parameters
index | The index of the row. Index starts from 0.
diameter | The value to be set. Must be a non-zero positive number.
Returns
Returns nothing if the operation was successful, or returns error:
if the index is out of range;
if the value is larger than the already defined main axis diameter;
if the value is larger or equal than the already defined length;
if branch offset is already defined and the value is larger than 2 * branchOffset;
if branch offset and length are already defined and the value is larger than 2 * (length - branchOffset).
◆ SetBranchAxisDiameterByKey()
 Result< void > ACAPI::MEP::DuctBranchPreferenceTable::Modifier::SetBranchAxisDiameterByKey  |  ( |  const Key & |  key,
|  double |  diameter )
Sets the branch axis diameter value of a table's row.
Parameters
key | The key that uniquely identifies a row in the DuctBranchPreferenceTable.
diameter | The value to be set. Must be a non-zero positive number.
If no row exists for the given key, but the key contains valid reference Ids and branch angle, it inserts the row.
Returns
Returns nothing if the operation was successful, or returns error:
if at least one referenceId from the key is not in the DuctReferenceSet;
if branchAxisAngle from the key is not in the DuctAngleSet;
if the value is larger than the already defined main axis diameter;
if the value is larger or equal than the already defined length;
if branch offset is already defined and the value is larger than 2 * branchOffset;
if branch offset and length are already defined and the value is larger than 2 * (length - branchOffset).
◆ SetBranchOffset()
 Result< void > ACAPI::MEP::DuctBranchPreferenceTable::Modifier::SetBranchOffset  |  ( |  uint32_t |  index,
|  double |  branchOffset )
Sets the branch offset value of a table's row.
Parameters
index | The index of the row. Index starts from 0.
branchOffset | The value to be set. Must be a non-zero positive number.
Returns
Returns nothing if the operation was successful, or returns error:
if the index is out of range;
if the value is smaller than (branchAxisDiameter / 2);
if length and branch axis diameter are already defined and the value is larger than the (length - branchAxisDiameter / 2).
◆ SetBranchOffsetByKey()
 Result< void > ACAPI::MEP::DuctBranchPreferenceTable::Modifier::SetBranchOffsetByKey  |  ( |  const Key & |  key,
|  double |  branchOffset )
Sets the branch offset value of a table's row.
Parameters
key | The key that uniquely identifies a row in the DuctBranchPreferenceTable.
branchOffset | The value to be set. Must be a non-zero positive number.
If no row exists for the given key, but the key contains valid reference Ids and branch angle, it inserts the row.
Returns
Returns nothing if the operation was successful, or returns error:
if at least one referenceId from the key is not in the DuctReferenceSet;
if branchAxisAngle from the key is not in the DuctAngleSet;
if the value is smaller than (branchAxisDiameter / 2);
if length and branch axis diameter are already defined and the value is larger than the (length - branchAxisDiameter / 2).
◆ SetConnectionLength()
 Result< void > ACAPI::MEP::DuctBranchPreferenceTable::Modifier::SetConnectionLength  |  ( |  uint32_t |  index,
|  double |  connectionLength )
Sets the connection length value of a table's row.
Parameters
index | The index of the row. Index starts from 0.
connectionLength | The value to be set. Must be a non-zero positive number.
Returns
Returns error if the index is out of range, otherwise nothing.
◆ SetConnectionLengthByKey()
 Result< void > ACAPI::MEP::DuctBranchPreferenceTable::Modifier::SetConnectionLengthByKey  |  ( |  const Key & |  key,
|  double |  connectionLength )
Sets the connection length value of a table's row.
Parameters
key | The key that uniquely identifies a row in the DuctBranchPreferenceTable.
connectionLength | The value to be set. Must be a non-zero positive number.
If no row exists for the given key, but the key contains valid reference Ids and branch angle, it inserts the row.
Returns
Returns error if at least one referenceId from the key is not in the DuctReferenceSet, or if the branchAxisAngle is not in the DuctAngleSet, otherwise nothing.
◆ SetDescription()
 Result< void > ACAPI::MEP::DuctBranchPreferenceTable::Modifier::SetDescription  |  ( |  uint32_t |  index,
|  const GS::UniString & |  description )
Sets the description of a table's row.
Parameters
index | The index of the row. Index starts from 0.
description | The description to be set.
Returns
Returns error if the index is out of range, otherwise nothing.
◆ SetDescriptionByKey()
 Result< void > ACAPI::MEP::DuctBranchPreferenceTable::Modifier::SetDescriptionByKey  |  ( |  const Key & |  key,
|  const GS::UniString & |  description )
Sets the description of a table's row.
Parameters
key | The key that uniquely identifies a row in the DuctBranchPreferenceTable.
description | The description to be set.
If no row exists for the given key, but the key contains valid reference Ids and branch angle, it inserts the row.
Returns
Returns error if at least one referenceId from the key is not in the DuctReferenceSet, or if the branchAxisAngle is not in the DuctAngleSet, otherwise nothing.
◆ SetLength()
 Result< void > ACAPI::MEP::DuctBranchPreferenceTable::Modifier::SetLength  |  ( |  uint32_t |  index,
|  double |  length )
Sets the length value of a table's row.
Parameters
index | The index of the row. Index starts from 0.
length | The value to be set. Must be a non-zero positive number.
Returns
Returns nothing if the operation was successful, or returns error:
if the index is out of range;
if the value is smaller than the branch axis diameter;
if the value is smaller than (branchOffset + branchAxisDiameter / 2).
◆ SetLengthByKey()
 Result< void > ACAPI::MEP::DuctBranchPreferenceTable::Modifier::SetLengthByKey  |  ( |  const Key & |  key,
|  double |  length )
Sets the diameter value of a table's row.
Parameters
key | The key that uniquely identifies a row in the DuctBranchPreferenceTable.
length | The value to be set. Must be a non-zero positive number.
If no row exists for the given key, but the key contains valid reference Ids and branch angle, it inserts the row.
Returns
Returns nothing if the operation was successful, or returns error:
if at least one referenceId from the key is not in the DuctReferenceSet;
if branchAxisAngle from the key is not in the DuctAngleSet;
if the value is smaller than the branch axis diameter;
if the value is smaller than (branchOffset + branchAxisDiameter / 2).
◆ SetMainAxisDiameter()
 Result< void > ACAPI::MEP::DuctBranchPreferenceTable::Modifier::SetMainAxisDiameter  |  ( |  uint32_t |  index,
|  double |  diameter )
Sets the main axis diameter value of a table's row.
Parameters
index | The index of the row. Index starts from 0.
diameter | The value to be set. Must be a non-zero positive number.
Returns
Returns error if the index is out of range or if the value is smaller than the branch axis diameter, otherwise nothing.
◆ SetMainAxisDiameterByKey()
 Result< void > ACAPI::MEP::DuctBranchPreferenceTable::Modifier::SetMainAxisDiameterByKey  |  ( |  const Key & |  key,
|  double |  diameter )
Sets the main axis diameter value of a table's row.
Parameters
key | The key that uniquely identifies a row in the DuctBranchPreferenceTable.
diameter | The value to be set. Must be a non-zero positive number.
If no row exists for the given key, but the key contains valid reference Ids and branch angle, it inserts the row.
Returns
Returns error if at least one referenceId from the key is not in the DuctReferenceSet, or if the branchAxisAngle is not in the DuctAngleSet, or if the value is smaller than the branch axis diameter, otherwise nothing.
◆ SetName()
 void ACAPI::MEP::DuctBranchPreferenceTable::Modifier::SetName  |  ( |  const GS::UniString & |  tableName | )
Sets the name of the table.
Parameters
tableName | The name to be set.